<template>
  <div class="rules">
    <h1 class="rules-center">Правила сервера</h1>
    <div class="rules-filter" v-if="storeClusters.items.length > 1">
      <button
        class="rules-filter__item"
        v-for="item in storeClusters.items"
        :item="item"
        :key="item.id"
        @click="activeClusterId = item.id"
        :class="{ active: activeClusterId === item.id }"
      >
        {{ item.name }}
      </button>
    </div>
    <template v-if="activeClusterId === 'a078648b-4712-43fd-a924-8315d73a6d15'">
      <p>
        Данное руководство правил для кластера сервера sataya.ru[NoWipe/NoRaid/Steam/PvPvE] <br />
        Правила будут обновляться и дополняться. Периодически проверяйте эту тему!
      </p>
      <h2>Общее:</h2>
      <ul>
        <li>
          Запрещено использование любых сторонних программ (читов), скриптов и багов, а также любых
          настроек, модификаций и уязвимостей игры/модов/сервера.
        </li>
        <li>
          Запрещено использование ников содержащих в себе нецензурную лексику/оскорбления/рекламу.
        </li>
        <li>
          Запрещено в локальном или голосовом чате оскорбления
          игроков/администрации/родителей/родственников, также разжигание межнациональной и расовой
          розни.
        </li>
        <li>
          Запрещено использовать реальные деньги во взаимоотношениях с другими игроками
          (покупка/продажа/вымогание).
        </li>
        <li>Запрещено призывать других игроков уйти с сервера.</li>
        <li>Запрещено любое удержание игроков в наручниках/клетках/постройках/наркотиками.</li>
        <li class="rules-text-transform">
          Запрещено убивать игроков, динозавров и наносить несогласованный ущерб постройкам других
          людей.
        </li>
        <li>
          Запрещено хранить и оставлять своих дино на обелисках/пещерах с артефактом/боссом на более
          чем 24 часа.
        </li>
        <li>Запрещено спамить в общем чате одним и тем же словом/предложением.</li>
        <li>Запрещено рекламировать другие сервера в чате и оставлять ссылки.</li>
        <li>Запрещено выпускать своих дино на агрессии вне своих баз.</li>
        <li>
          Запрещено вступать в трайбы с целью ограбления-инсайд (Внимание!!! Ответственно относитесь
          к подбору своих сотрайбов, выставляйте ранги у себя в трайбе, чтобы этого избежать,
          администрация не может контролировать этот процесс)
        </li>
      </ul>
      <h2>Рейды и войны:</h2>
      <ul>
        <li>
          На сервере sataya.ru[NoWipe/NoRaid/Steam/PvPvE] - Рейды ЗАПРЕЩЕНЫ. <br />
          Наказание БАН - без исключений!!!<br /><br />
          Это PVP сервер на котором разрешены только согласованные рейды. Что это значит? Вы
          приходите на сервер, знакомитесь со всеми жителями, и обязательно найдете себе друга,
          который захочет с вами устроить согласованный взаимный рейд, который закончится крепкой
          дружбой и хорошим настроением с обеих сторон. <br />
          Если к Вам проявили агрессию, сильно нагрубили, оскорбили, нанесли серьезный ущерб вам или
          вашему трайбу, то нужно сразу же написать об этом администрации в дискорд. Ваш обидчик
          будет забанен! При этом произойдет откат сервера и все потерянные вещи вам вернутся
          обратно. При откате сервера пострадают ВСЕ игроки поэтому этим нельзя злоупотреблять!
          Давайте жить дружно и уважать труд, время и старания друг друга.
        </li>
        <li>
          Рейды запрещены, но при этом, Вы не должны забывать о защите и охране вашей базы и вашего
          имущества. Ваши ворота, двери, шкафы, сейфы и другие вещи должны быть защищены.
          Разрешается ставить турели в любых количествах на своей территории для предотвращения
          прихода незваных гостей, только расположите их так, чтоб они не мешали передвигаться по
          карте другим игрокам.
        </li>
        <li>
          На сервере установлен таймер на разрушение построек, если владелец не появляется в
          прорисовке, то их можно будет разрушить через:<br />
          Солома - 8 дней<br />
          Дерево - 16 дня<br />
          Камень - 24 дней<br />
          Металл - 32 дней<br />
          Тек - 40 дней<br />
          Соответственно, если таймер закончился - появится надпись: 'Разрушить' - вы имеете полное
          право забрать 'лут' с чужой базы, при этом желательно разрушить брошенные постройки.
        </li>
        <li>
          На сервере установлен таймер на клеймление чужих дино по истечению таймера в 35 дней, если
          владелец не появляется в прорисовке. <br />
          Соответственно, если таймер закончился - появится надпись: 'Заклеймить' - вы имеете полное
          право забрать 'дино'.
        </li>
      </ul>
      <h2>Стройка:</h2>
      <ul>
        <li>
          Запрещена застройка обелисков, записок, терминалов перемещения между картами и места
          спавна игроков.
        </li>
        <li>
          Запрещена блокировка, застройка и другие виды препятствий прохода в пещеры с артефактами,
          высоким спавном ресурсов, лучам, а также подводным, наземным и другим видам контейнеров.
        </li>
        <li>
          Запрещено строить базы около обелисков и ставить турели вблизи обелиска. Игроки, при
          использовании обелисков и терминалов, должны спокойно отходить от них, не боясь наткнуться
          на ваши турели.
        </li>
        <li>
          Запрещено строиться вплотную к чужим постройкам и ограничивать развитие другого трайба
          своими постройками.
        </li>
        <li>
          Запрещены постройки баз в космическом биоме и в проходах между биомами на карте Genesis2.
          Вы можете построить ловушку или место для хранилища ресурсов, но это не должно мешать
          другим игрокам и блокировать проходы.
        </li>
        <li>
          На нашем сервере включена настройка коллизии, которая при размещении построек позволяет
          игнорировать геометрию местности. Работает исключительно для помощи при постройке на
          неровной поверхности.
        </li>
        <li>Вы НЕ МОЖЕТЕ строить базу в текстурах ( она будет удалена ).</li>
        <li>Ловушки и клетки для приручения дино должны быть открыты для всех!</li>
        <li>
          После приручения или вступления в другой трайб, убирайте за собой
          постройки/шипы/ловушки/фундаменты! Не засоряйте карты мусором!!!
        </li>
      </ul>
    </template>
    <template v-if="activeClusterId !== 'a078648b-4712-43fd-a924-8315d73a6d15'">
      Нет данных
    </template>
  </div>
</template>

<script setup>
import { ref, onMounted } from 'vue';
import { useClustersStore } from '@stores/clusters';
const storeClusters = useClustersStore();
const activeClusterId = ref(false);

onMounted(async () => {
  await storeClusters.load();
  activeClusterId.value = storeClusters.items[0].id;
});
</script>

<style lang="scss" scope>
.rules {
  @include container;

  padding: 0 0 rem(20px) 0;
  font-size: rem(20px);
  color: map-get($theme-color, 'white');
  line-height: 1.45em;

  a {
    color: inherit;
    text-decoration: none;

    &:hover {
      color: map-get($theme-color, 'active');
    }
  }

  &-text-transform {
    text-transform: uppercase;
  }
  &-center {
    text-align: center;
  }
  &-filter {
    display: flex;
    justify-content: center;
    padding: rem(10px) 0 rem(30px) 0;

    @include mobile {
      padding: 0;
    }

    &__item {
      position: relative;
      height: rem(40px);
      width: rem(200px);
      padding: 0 rem(20px);
      margin: 0 rem(20px) 0 0;
      border-radius: rem(5px);
      display: inline-flex;
      align-items: center;
      justify-content: center;

      font-size: rem(20px);
      line-height: 1;
      font-weight: 900;
      color: map-get($theme-color, 'white');
      text-shadow: $text-shadow;
      border: rem(1px) solid map-get($theme-color, 'active');
      text-decoration: none;
      background: $bg-circle;
      transition:
        background-color 0.5s,
        border-color 0.5s;

      cursor: pointer;

      &:hover,
      &.active {
        background: darken(map-get($theme-color, 'active'), 20%);
        border-color: lighten(map-get($theme-color, 'active'), 50%);
      }

      @include mobile {
        padding: 0 rem(14px);
        font-size: rem(14px);
        width: rem(110px);
        margin: 0 rem(10px);
      }
    }
  }

  @include mobile {
    padding: 0 rem(10px);
    font-size: rem(14px);

    h1 {
      font-size: rem(20px);
      text-transform: uppercase;
    }

    h2 {
      font-size: rem(16px);
    }

    p br {
      display: none;
    }
  }
}
</style>
